[
    {
        "title" : "Portfolio",
        "description" : "Created a personal portfolio website to showcase projects, skills, and experiences, with a focus on responsive design and user-friendly navigation.",
        "tags" : ["ReactJS", "Javascript", "TailwindCSS"]
    },
    {
        "title" : "QuillCraft",
        "description" : "Built a collaborative online writing platform that supports real-time editing blogs with user interactions for example liking, commenting, bookmarking blogs.",
        "tags" : ["ReactJS", "MongoDB", "mongoose", "NodeJS", "Javascript", "ExpressJS", "TailwindCSS"]
    },
    {
       "title" : "User Registration (Backend)",
       "description" : "Developed a scalable and efficient backend system using Node.js and Express, focusing on RESTful API design and database optimization.",
       "tags" : ["MongoDB", "mongoose", "NodeJS", "ExpressJS", "Javascript"] 
    },
    {
        "title" : "Notion Clone",
        "description" : "Developed a fully-functional Notion clone, enabling users to create, edit, and organize notes and tasks with rich text formatting and real-time collaboration features. The application supports drag-and-drop capabilities, customizable templates, and seamless data synchronization across devices, providing a versatile workspace for both personal and team productivity.",
        "tags" : ["NextJS", "mySQL", "Prisma", "Typescript", "TailwindCSS"]
    },
    {
        "title" : "PDF Chatbot",
        "description" : "Created a platform where users can upload PDFs and receive accurate answers to their questions via embedded AI.Composed an AI system to provide precise and contextually relevant answers from uploaded PDFs",
        "tags" : ["NextJS", "mySQL", "Prisma", "Typescript", "TailwindCSS"]
    },
    {
        "title" : "LifeFlow",
        "description" : "",
        "tags" : ["EJS", "MongoDB", "mongoose", "Javascript", "NodeJS", "ExpressJS", "CSS"]
    },
    {
        "title" : "Connect",
        "description" : "Enabled users to connect and communicate seamlessly through web-based chat. Implemented end-to-end encryption using the Diffie-Hellman key exchange and AES-256 encryption algorithms to secure users messages. Ensured that all user communications are protected and inaccessible to unauthorized parties.",
        "tags" : ["ReactJS", "MongoDB", "mongoose", "NodeJS", "ExpressJS", "Javascript", "Socket.io", "Encryption", "CSS"]
    },
    {
        "title" : "BlogItOut",
        "description" : "Built a collaborative online writing platform that supports real-time editing blogs with user interactions for example liking, commenting, bookmarking blogs.",
        "tags" : ["EJS", "NodeJS", "ExpressJS", "MongoDB", "mongoose", "Javascript", "CSS"]
    },
    {
        "title" : "Snake Game",
        "description" : "Built a classic snake game, featuring various levels and scoring mechanisms for an engaging gaming experience",
        "tags" : ["HTML", "Javascript", "CSS"]
    },
    {
        "title" : "Password Generator",
        "description" : "Developed a secure password generator to create strong, random passwords, enhancing user security and data protection.",
        "tags" : ["ReactJS", "TailwindCSS", "Javascript"]
    },
    {
        "title" : "Currency Converter",
        "description" : "Implemented a currency converter tool that allows users to convert between different currencies with real-time exchange rates.",
        "tags" : ["ReactJS", "TailwindCSS", "Javascript"]
    },
    {
        "title" : "Weather Report",
        "description" : "Created a weather forecasting application that provides real-time weather data and predictions using API integrations for location-based services.",
        "tags" : ["REST-Api", "Javascript", "HTML", "CSS"]
    },
    {
        "title" : "Event Handler",
        "description" : "Developed a feature-rich ToDo app to help users efficiently manage tasks and boost productivity. The application provides a user-friendly interface for creating, editing, organizing, and tracking tasks.",
        "tags" : ["Javascript", "HTML", "CSS"]
    },
    {
        "title" : "Calculator",
        "description" : "Developed a basic calculator app with functions for arithmetic operations, supporting a simple and intuitive user interface.",
        "tags" : ["Javascript", "HTML", "CSS"]
    }
]